trade_exp/src/InformationRegisters/Комплектующие/Комплектующие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="7c21c9eb-9df5-4cca-ba56-4681c850f485">
  <name>Комплектующие</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="97b54818-9d01-470c-ae55-241f95c9d4fd">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="373fecea-e767-4193-b075-1ef3ab2ca898">
    <name>Комплектующее</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/Комплектующие/Forms/ФормаЗагрузки/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТабличныйДокумент.ФиксацияСверху = 1;
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)     
	ТаблицаЗначений.Очистить();	
	
	НомерСтроки = 2;
	Пока Истина Цикл
		стрНомерСтроки = Формат(НомерСтроки, "ЧРГ=; ЧГ=0");
		
		КодТовара = СокрЛП(ТабличныйДокумент.Область("R" + стрНомерСтроки + "C1").Текст);
		НаименованиеТовара = СокрП(ТабличныйДокумент.Область("R" + стрНомерСтроки + "C2").Текст);  
		
		Если ПустаяСтрока(КодТовара) И ПустаяСтрока(НаименованиеТовара) Тогда 
			Прервать;                                                          
		КонецЕсли;
		
		НомерКолонки = 3;
		Пока Истина Цикл 
			стрНомерКолонки = Формат(НомерКолонки, "ЧРГ=; ЧГ=0");
			КодКомплектующего = СокрЛП(ТабличныйДокумент.Область("R" + стрНомерСтроки + "C" + стрНомерКолонки).Текст); 

			стрНомерКолонки = Формат(НомерКолонки + 1, "ЧРГ=; ЧГ=0");
			НаименованиеКомплектующего = СокрП(ТабличныйДокумент.Область("R" + стрНомерСтроки + "C" + стрНомерКолонки).Текст); 
			
			Если ПустаяСтрока(КодКомплектующего) И ПустаяСтрока(НаименованиеКомплектующего) Тогда 
				Прервать;                                                          
			КонецЕсли;     
			
			СтрутураПоиска = Новый Структура;
    		СтрутураПоиска.Вставить("КодТовара", КодТовара);
			СтрутураПоиска.Вставить("НаименованиеТовара", НаименованиеТовара);
			СтрутураПоиска.Вставить("КодКомплектующего", КодКомплектующего);
			СтрутураПоиска.Вставить("НаименованиеКомплектующего", НаименованиеКомплектующего);
    		НайденныеСтроки = ТаблицаЗначений.НайтиСтроки(СтрутураПоиска);
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				СтрокаТЗ = ТаблицаЗначений.Добавить();
				СтрокаТЗ.НомерСтроки = НомерСтроки;
				СтрокаТЗ.НомерКолонки = НомерКолонки;
				СтрокаТЗ.КодТовара = КодТовара;
				СтрокаТЗ.НаименованиеТовара = НаименованиеТовара;
				СтрокаТЗ.КодКомплектующего = КодКомплектующего; 
				СтрокаТЗ.НаименованиеКомплектующего = НаименованиеКомплектующего;
			КонецЕсли;                                                           
			
			НомерКолонки = НомерКолонки + 2;
		КонецЦикла;
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере() 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаТовары.НомерСтроки,
		|	ТаблицаТовары.НомерКолонки,                     
		|	ТаблицаТовары.КодТовара,				
		|	ТаблицаТовары.НаименованиеТовара,
		|	ТаблицаТовары.КодКомплектующего,				
		|	ТаблицаТовары.НаименованиеКомплектующего
		|ПОМЕСТИТЬ втТовары
		|ИЗ
		|	&ТаблицаТовары КАК ТаблицаТовары
        | ;
        |   
		|ВЫБРАТЬ
		|	Ссылка,
		|	Код,                     
		|	Наименование           
		|ПОМЕСТИТЬ втНоменклатура
		|ИЗ
		|	Справочник.Номенклатура 
		|ИНДЕКСИРОВАТЬ ПО
		|	Код,
		|	Наименование		
		|;
        |   
        | ///////////////////////////////////////////////////////////
        |ВЫБРАТЬ  
		|	втТовары.НомерСтроки,
		|	втТовары.НомерКолонки,     
		|	втТовары.КодТовара,				
		|	втТовары.НаименованиеТовара,
		|	втТовары.КодКомплектующего,				
		|	втТовары.НаименованиеКомплектующего,		
		|	ЕСТЬNULL(НоменклатураТовараПоКоду.Ссылка, НоменклатураТовараПоНаименованию.Ссылка) КАК СсылкаТовара, 
		|	ЕСТЬNULL(НоменклатураКомплектующегоПоКоду.Ссылка, НоменклатураКомплектующегоПоНаименованию.Ссылка) КАК СсылкаКомплектующего, 
		|	НоменклатураТовараПоКоду.Наименование НаименованиеТовараПоКоду,
		|	НоменклатураТовараПоНаименованию.Код КодТовараПоНаименованию,	
		|	НоменклатураКомплектующегоПоКоду.Наименование НаименованиеКомплектующегоПоКоду,
		|	НоменклатураКомплектующегоПоНаименованию.Код КодКомплектующегоПоНаименованию,		
		|	ВЫБОР 
		|		КОГДА 
		|			НоменклатураТовараПоКоду.Ссылка ЕСТЬ NULL 
		|			И НоменклатураТовараПоНаименованию.Ссылка ЕСТЬ NULL 
		|		ТОГДА 1	  
		|		КОГДА   
		|			НоменклатураТовараПоКоду.Ссылка ЕСТЬ НЕ NULL
		|			И НоменклатураТовараПоНаименованию.Ссылка ЕСТЬ НЕ NULL
		|			И НоменклатураТовараПоКоду.Наименование <> НоменклатураТовараПоНаименованию.Наименование 
		|		ТОГДА 2	  
		|		КОГДА 
		|			НоменклатураКомплектующегоПоКоду.Ссылка ЕСТЬ NULL 
		|			И НоменклатураКомплектующегоПоНаименованию.Ссылка ЕСТЬ NULL 
		|		ТОГДА 3	  
		|		КОГДА 
		|			НоменклатураКомплектующегоПоКоду.Ссылка ЕСТЬ НЕ NULL
		|			И НоменклатураКомплектующегоПоНаименованию.Ссылка ЕСТЬ НЕ NULL
		|			И НоменклатураКомплектующегоПоКоду.Наименование <> НоменклатураКомплектующегоПоНаименованию.Наименование 
		|		ТОГДА 4
		|		ИНАЧЕ 0	 
		|	КОНЕЦ КАК КодОшибки  
		|ПОМЕСТИТЬ
		|	втТоварыПроверенные
	    |ИЗ 
        | 	втТовары 
        |ЛЕВОЕ СОЕДИНЕНИЕ
        | 	втНоменклатура КАК НоменклатураТовараПоКоду
        |ПО
        | 	втТовары.КодТовара = НоменклатураТовараПоКоду.Код	   
        |ЛЕВОЕ СОЕДИНЕНИЕ
        | 	втНоменклатура КАК НоменклатураТовараПоНаименованию
        |ПО
        | 	втТовары.НаименованиеТовара = НоменклатураТовараПоНаименованию.Наименование
        |ЛЕВОЕ СОЕДИНЕНИЕ
        | 	втНоменклатура КАК НоменклатураКомплектующегоПоКоду
        |ПО
        | 	втТовары.КодКомплектующего = НоменклатураКомплектующегоПоКоду.Код	
        |ЛЕВОЕ СОЕДИНЕНИЕ
        | 	втНоменклатура КАК НоменклатураКомплектующегоПоНаименованию
        |ПО
        | 	втТовары.НаименованиеКомплектующего = НоменклатураКомплектующегоПоНаименованию.Наименование	
        |;    
        | 
       	|///////////////////////////////////////////////////////////  
        |ВЫБРАТЬ  
		|	НомерСтроки,
		|	НомерКолонки,         
        | 	КодТовара,
		|	КодКомплектующего,				
		|	КодОшибки,
		|	НаименованиеТовараПоКоду,
		|	КодТовараПоНаименованию,	
		|	НаименованиеКомплектующегоПоКоду,
		|	КодКомплектующегоПоНаименованию		
        |ИЗ
        | 	втТоварыПроверенные
        |ГДЕ 
        |	КодОшибки > 0  
       	|;
        |
       	|///////////////////////////////////////////////////////////  
        |ВЫБРАТЬ РАЗЛИЧНЫЕ 
        |	СсылкаТовара КАК Номенклатура,
        |	СсылкаКомплектующего КАК Комплектующее   
		|ПОМЕСТИТЬ втТоварыВРегистр
        |ИЗ
        |	втТоварыПроверенные 
		|ГДЕ
		|	втТоварыПроверенные.КодОшибки = 0  
       	|;
        |
       	|///////////////////////////////////////////////////////////  
        |ВЫБРАТЬ  
        |	втТоварыВРегистр.Номенклатура,
        |	втТоварыВРегистр.Комплектующее 
        |ИЗ
        |	втТоварыВРегистр
        |ЛЕВОЕ СОЕДИНЕНИЕ
        |	РегистрСведений.Комплектующие КАК Комплектующие
        |ПО 
        |	втТоварыВРегистр.Номенклатура = Комплектующие.Номенклатура
        |	И втТоварыВРегистр.Комплектующее = Комплектующие.Комплектующее
        |ГДЕ 
        |	Комплектующие.Номенклатура ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ТаблицаТовары", ТаблицаЗначений.Выгрузить());  
	
	МассивРезультатов = Запрос.ВыполнитьПакет();        

	ЦветОшибки = WebЦвета.Желтый;
	ЕстьОшибки = Ложь;
	
	Выборка = МассивРезультатов[3].Выбрать();
	Пока Выборка.Следующий() Цикл    
		ЕстьОшибки = Истина;		
		
		Если Выборка.КодОшибки = 1 Или Выборка.КодОшибки = 2 Тогда  
			ТабличныйДокумент.Область("R" + Строка(Выборка.НомерСтроки) + "C1").ЦветФона = ЦветОшибки;			
			ТабличныйДокумент.Область("R" + Строка(Выборка.НомерСтроки) + "C2").ЦветФона = ЦветОшибки;			
			
			Если Выборка.КодОшибки = 1 Тогда
				ТабличныйДокумент.Область("R" + Строка(Выборка.НомерСтроки) + "C1").Примечание.Текст = "Не найден товар по коду";
				ТабличныйДокумент.Область("R" + Строка(Выборка.НомерСтроки) + "C2").Примечание.Текст = "Не найден товар по наименованию";                 
			Иначе                                                                                                                                         
				ТабличныйДокумент.Область("R" + Строка(Выборка.НомерСтроки) + "C1").Примечание.Текст = "Найденный по коду товар имеет другое наименование """ + Выборка.НаименованиеТовараПоКоду + """";
				ТабличныйДокумент.Область("R" + Строка(Выборка.НомерСтроки) + "C2").Примечание.Текст = "Найденный по наименованию товар имеет другой код """ + Выборка.КодТовараПоНаименованию + """";                 
			КонецЕсли;
		Иначе
			ТабличныйДокумент.Область("R" + Строка(Выборка.НомерСтроки) + "C" + Строка(Выборка.НомерКолонки)).ЦветФона = ЦветОшибки;			
			ТабличныйДокумент.Область("R" + Строка(Выборка.НомерСтроки) + "C" + Строка(Выборка.НомерКолонки + 1)).ЦветФона = ЦветОшибки;			

			Если Выборка.КодОшибки = 3 Тогда
				ТабличныйДокумент.Область("R" + Строка(Выборка.НомерСтроки) + "C" + Строка(Выборка.НомерКолонки)).Примечание.Текст = "Не найден комплектующий по коду";
				ТабличныйДокумент.Область("R" + Строка(Выборка.НомерСтроки) + "C" + Строка(Выборка.НомерКолонки + 1)).Примечание.Текст = "Не найден комплектующий по наименованию";                 
			Иначе                                                                                                                                         
				ТабличныйДокумент.Область("R" + Строка(Выборка.НомерСтроки) + "C" + Строка(Выборка.НомерКолонки)).Примечание.Текст = "Найденный по коду комплектующий имеет другое наименование """ + Выборка.НаименованиеКомплектующегоПоКоду + """";
				ТабличныйДокумент.Область("R" + Строка(Выборка.НомерСтроки) + "C" + + Строка(Выборка.НомерКолонки + 1)).Примечание.Текст = "Найденный по наименованию комплектующий имеет другой код """ + Выборка.КодКомплектующегоПоНаименованию + """";                 
			КонецЕсли;
		КонецЕсли;   
	КонецЦикла;
	
	Выборка = МассивРезультатов[5].Выбрать();
	Пока Выборка.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.Комплектующие.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Номенклатура.Установить(Выборка.Номенклатура); 
		НаборЗаписей.Отбор.Комплектующее.Установить(Выборка.Комплектующее); 

		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Номенклатура = Выборка.Номенклатура;
		НоваяЗапись.Комплектующее = Выборка.Комплектующее;
		
		НаборЗаписей.Записать();
	КонецЦикла;  
	
	РезультатЗагрузки = "Загрузка выполнена";
	РезультатЗагрузки = РезультатЗагрузки + ?(ЕстьОшибки, " с ошибками.", ".");
	Сообщить(РезультатЗагрузки);
КонецПроцедуры
